Revit 2015 API
FormatOptions.HasRounding Method
 Checks whether the display unit in this FormatOptions has an accuracy value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2015.  All display units now have accuracy values, so this method will return true for all display units.")]
public bool HasRounding()
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2015.  All display units now have accuracy values, so this method will return true for all display units.")> _
Public Function HasRounding As Boolean
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2015.  All display units now have accuracy values, so this method will return true for all display units.")]
public:
bool HasRounding()
Return Value
 True if the display unit has an accuracy value. Returns true for all display units.
Remarks
 All display units now have accuracy values, so this method always returns true when UseDefault is false.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  UseDefault is true in this FormatOptions.
See Also
FormatOptions Class
Autodesk.Revit.DB Namespace